input_output/slides.tex
% Created 2010-10-10 Sun 21:00
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{I/O}
\author{FOSSEE}
\date{}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle









\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item Showing output to the user.
\item Taking input from the user.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-2}

  What happens when you do \texttt{print "x is \%d y is \%f" \%(x, y)}
\end{frame}
\begin{frame}
\frametitle{Solution 1}
\label{sec-3}

  \texttt{int} value of \texttt{x} and \texttt{float} value of \texttt{y} are printed corresponding to the
  modifiers used in the \texttt{print} statement
\end{frame}
\begin{frame}
\frametitle{Question 2}
\label{sec-4}

  Enter the number 5.6 as input and store it in a variable called
  \texttt{c}. 
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 2}
\label{sec-5}

\lstset{language=Python}
\begin{lstlisting}
In []: c = raw_input() 
5.6
In []: c
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Question 3}
\label{sec-6}

  What happens when you do not enter anything and hit enter
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 3}
\label{sec-7}

\lstset{language=Python}
\begin{lstlisting}
In []: c = raw_input() 
<RET>
In []: c
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Question 4}
\label{sec-8}

  How do you display a prompt and let the user enter input in a new line
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 4}
\label{sec-9}

\lstset{language=Python}
\begin{lstlisting}
In []: ip = raw_input("Please enter a number in the next line\n> ")
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Summary}
\label{sec-10}

  You should now be able to --
\begin{itemize}
\item Print a value ``as is''
\item Print a value using using modifiers
\item Accept input from user
\item Display a prompt before accepting input
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-11}

  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
\end{frame}

\end{document}
